12:22:51 : ----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv3d-1      [-1, 128, 17, 38, 51]           3,584
       BatchNorm3d-2      [-1, 128, 17, 38, 51]             256
            Conv3d-3       [-1, 128, 8, 19, 25]         442,496
       BatchNorm3d-4       [-1, 128, 8, 19, 25]             256
            Conv3d-5        [-1, 256, 4, 9, 12]         884,992
       BatchNorm3d-6        [-1, 256, 4, 9, 12]             512
            Conv3d-7         [-1, 256, 2, 4, 6]       1,769,728
       BatchNorm3d-8         [-1, 256, 2, 4, 6]             512
 AdaptiveAvgPool3d-9         [-1, 256, 1, 1, 1]               0
       Raw_stream-10         [-1, 256, 1, 1, 1]               0
           Conv3d-11       [-1, 64, 17, 38, 51]           3,520
      BatchNorm3d-12       [-1, 64, 17, 38, 51]             128
           Conv3d-13       [-1, 128, 8, 19, 25]         221,312
      BatchNorm3d-14       [-1, 128, 8, 19, 25]             256
           Conv3d-15        [-1, 256, 4, 9, 12]         884,992
      BatchNorm3d-16        [-1, 256, 4, 9, 12]             512
           Conv3d-17         [-1, 256, 2, 4, 6]       1,769,728
      BatchNorm3d-18         [-1, 256, 2, 4, 6]             512
AdaptiveAvgPool3d-19         [-1, 256, 1, 1, 1]               0
        OF_Stream-20         [-1, 256, 1, 1, 1]               0
           Linear-21                  [-1, 128]          65,664
          Dropout-22                  [-1, 128]               0
           Linear-23                   [-1, 64]           8,256
          Dropout-24                   [-1, 64]               0
           Linear-25                    [-1, 2]             130
================================================================
Total params: 6,057,346
Trainable params: 6,057,346
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 8102.76
Forward/backward pass size (MB): 115.13
Params size (MB): 23.11
Estimated Total Size (MB): 8240.99
----------------------------------------------------------------
 
12:34:11 : ----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv3d-1      [-1, 128, 17, 38, 51]           3,584
       BatchNorm3d-2      [-1, 128, 17, 38, 51]             256
            Conv3d-3       [-1, 128, 8, 19, 25]         442,496
       BatchNorm3d-4       [-1, 128, 8, 19, 25]             256
            Conv3d-5        [-1, 256, 4, 9, 12]         884,992
       BatchNorm3d-6        [-1, 256, 4, 9, 12]             512
            Conv3d-7         [-1, 256, 2, 4, 6]       1,769,728
       BatchNorm3d-8         [-1, 256, 2, 4, 6]             512
 AdaptiveAvgPool3d-9         [-1, 256, 1, 1, 1]               0
       Raw_stream-10         [-1, 256, 1, 1, 1]               0
           Conv3d-11       [-1, 64, 17, 38, 51]           3,520
      BatchNorm3d-12       [-1, 64, 17, 38, 51]             128
           Conv3d-13       [-1, 128, 8, 19, 25]         221,312
      BatchNorm3d-14       [-1, 128, 8, 19, 25]             256
           Conv3d-15        [-1, 256, 4, 9, 12]         884,992
      BatchNorm3d-16        [-1, 256, 4, 9, 12]             512
           Conv3d-17         [-1, 256, 2, 4, 6]       1,769,728
      BatchNorm3d-18         [-1, 256, 2, 4, 6]             512
AdaptiveAvgPool3d-19         [-1, 256, 1, 1, 1]               0
        OF_Stream-20         [-1, 256, 1, 1, 1]               0
           Linear-21                  [-1, 128]          65,664
          Dropout-22                  [-1, 128]               0
           Linear-23                   [-1, 64]           8,256
          Dropout-24                   [-1, 64]               0
           Linear-25                    [-1, 2]             130
================================================================
Total params: 6,057,346
Trainable params: 6,057,346
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 8102.76
Forward/backward pass size (MB): 115.13
Params size (MB): 23.11
Estimated Total Size (MB): 8240.99
----------------------------------------------------------------
 
13:09:28 : ----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv3d-1      [-1, 128, 17, 38, 51]           3,584
       BatchNorm3d-2      [-1, 128, 17, 38, 51]             256
            Conv3d-3       [-1, 128, 8, 19, 25]         442,496
       BatchNorm3d-4       [-1, 128, 8, 19, 25]             256
            Conv3d-5        [-1, 256, 4, 9, 12]         884,992
       BatchNorm3d-6        [-1, 256, 4, 9, 12]             512
            Conv3d-7         [-1, 256, 2, 4, 6]       1,769,728
       BatchNorm3d-8         [-1, 256, 2, 4, 6]             512
 AdaptiveAvgPool3d-9         [-1, 256, 1, 1, 1]               0
       Raw_stream-10         [-1, 256, 1, 1, 1]               0
           Conv3d-11       [-1, 64, 17, 38, 51]           3,520
      BatchNorm3d-12       [-1, 64, 17, 38, 51]             128
           Conv3d-13       [-1, 128, 8, 19, 25]         221,312
      BatchNorm3d-14       [-1, 128, 8, 19, 25]             256
           Conv3d-15        [-1, 256, 4, 9, 12]         884,992
      BatchNorm3d-16        [-1, 256, 4, 9, 12]             512
           Conv3d-17         [-1, 256, 2, 4, 6]       1,769,728
      BatchNorm3d-18         [-1, 256, 2, 4, 6]             512
AdaptiveAvgPool3d-19         [-1, 256, 1, 1, 1]               0
        OF_Stream-20         [-1, 256, 1, 1, 1]               0
           Linear-21                  [-1, 128]          65,664
          Dropout-22                  [-1, 128]               0
           Linear-23                   [-1, 64]           8,256
          Dropout-24                   [-1, 64]               0
           Linear-25                    [-1, 2]             130
================================================================
Total params: 6,057,346
Trainable params: 6,057,346
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 8102.76
Forward/backward pass size (MB): 115.13
Params size (MB): 23.11
Estimated Total Size (MB): 8240.99
----------------------------------------------------------------
 
15:21:57 : ----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv3d-1      [-1, 128, 17, 38, 51]           3,584
       BatchNorm3d-2      [-1, 128, 17, 38, 51]             256
            Conv3d-3       [-1, 128, 8, 19, 25]         442,496
       BatchNorm3d-4       [-1, 128, 8, 19, 25]             256
            Conv3d-5        [-1, 256, 4, 9, 12]         884,992
       BatchNorm3d-6        [-1, 256, 4, 9, 12]             512
            Conv3d-7         [-1, 256, 2, 4, 6]       1,769,728
       BatchNorm3d-8         [-1, 256, 2, 4, 6]             512
 AdaptiveAvgPool3d-9         [-1, 256, 1, 1, 1]               0
       Raw_stream-10         [-1, 256, 1, 1, 1]               0
           Conv3d-11       [-1, 64, 17, 38, 51]           3,520
      BatchNorm3d-12       [-1, 64, 17, 38, 51]             128
           Conv3d-13       [-1, 128, 8, 19, 25]         221,312
      BatchNorm3d-14       [-1, 128, 8, 19, 25]             256
           Conv3d-15        [-1, 256, 4, 9, 12]         884,992
      BatchNorm3d-16        [-1, 256, 4, 9, 12]             512
           Conv3d-17         [-1, 256, 2, 4, 6]       1,769,728
      BatchNorm3d-18         [-1, 256, 2, 4, 6]             512
AdaptiveAvgPool3d-19         [-1, 256, 1, 1, 1]               0
        OF_Stream-20         [-1, 256, 1, 1, 1]               0
           Linear-21                  [-1, 128]          65,664
          Dropout-22                  [-1, 128]               0
           Linear-23                   [-1, 64]           8,256
          Dropout-24                   [-1, 64]               0
           Linear-25                    [-1, 2]             130
================================================================
Total params: 6,057,346
Trainable params: 6,057,346
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 8102.76
Forward/backward pass size (MB): 115.13
Params size (MB): 23.11
Estimated Total Size (MB): 8240.99
----------------------------------------------------------------
 
